# Taps
tap 'caskroom/cask'
tap 'caskroom/fonts'
tap 'caskroom/versions'
tap 'homebrew/bundle'
tap 'homebrew/dupes'

# Make sure apps get installed in system Applications dir
cask_args appdir: '/Applications'

# Install ZSH
brew 'zsh'
brew 'zsh-completions'

# Install GNU core utilities (those that come with OS X are outdated)
brew 'coreutils'

# Install GNU `find`, `locate`, `updatedb`, and `xargs`, g-prefixed
brew 'findutils'

# Install Bash 4
brew 'bash'

# Install more recent versions of some OS X tools
brew 'homebrew/dupes/grep'

cask 'java'

# Install Binaries
brew 'awscli'
brew 'aspell'
brew 'boot-clj'
brew 'leiningen'
brew 'elasticsearch'
brew 'elixir'
tap  'd12frosted/emacs-plus'
brew 'emacs-plus'
brew 'erlang'
brew 'git'
brew 'mysql'
brew 'openssl'
brew 'phantomjs'
brew 'pyenv'
brew 'postgresql'
brew 'the_platinum_searcher'
brew 'the_silver_searcher'
brew 'tree'
brew 'redis'
brew 'node'
brew 'trash'
brew 'yarn'
brew 'wget'

# Apps
cask 'atom'
cask 'dropbox'
cask 'firefox'
cask 'google-chrome'
cask 'google-drive'
cask 'gitup'
cask 'keybase'
cask 'iterm2'
cask 'postman'
cask 'slack'
cask 'spotify'
cask 'keepassx'
cask 'tunnelblick'
cask 'transmission'
cask 'vlc'

# eonts
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
cask 'font-source-serif-pro'