# Taps
tap "1password/tap"
tap "d12frosted/emacs-plus"
tap "homebrew/bundle"
tap "homebrew/cask-eid"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/services"
tap "koekeishiya/formulae"
tap "oktadeveloper/tap"
tap "warrensbox/tap"

# Language shims
brew "asdf"
# Build tooling
brew "coreutils"
brew "pkg-config"
brew "cmake"
brew "moreutils"
# Compression
brew "bzip2"
brew "xz"
# Crypto
brew "libksba"
brew "gnupg"
brew "openssl"
# Text/Image processors
brew "harfbuzz"
brew "librsvg"
brew "graphviz"
brew "gdk-pixbuf"
# Editor
brew "bat"
brew "watchexec"
brew "starship"
brew "neovim"
brew "direnv"
brew "git"
brew "git-secrets"
# Databases
brew "postgresql@14"
brew "mysql@5.7", restart_service: true
brew "redis", restart_service: true
# Search
brew "ripgrep"
brew "tree"
brew "fd"
brew "fzf"
# Parsers
brew "jq"
brew "yq"
brew "zlib"
brew "koekeishiya/formulae/skhd"
brew "libxml2"
brew "libxmlsec1"
brew "protobuf@3"
# Apps
cask "1password-cli"
cask "okta"
cask "spotify", args: { appdir: "/Applications" }
cask "wezterm"
cask "zoom"

# DivvyCloud Specific
brew "libxmlsec1"
brew "pyenv"
brew "pyenv-virtualenv"
brew "warrensbox/tap/tfswitch"

