# Taps
tap 'homebrew/cask'
tap 'homebrew/cask-eid'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/bundle'
tap 'd12frosted/emacs-plus'

# Make sure apps get installed in system Applications dir
cask_args appdir: '/Applications'

# Binaries
brew 'awscli'
brew 'asdf'
brew 'bash' # Latest Bash version
brew 'bat' # "cat" on steroids
brew 'coreutils'
brew 'git'
brew 'fzf'
brew 'fd'
brew 'mackup'
brew 'kubectl'
brew 'mas' # Mac App Store manager
brew 'pkg-config' # https://github.com/driesvints/dotfiles/issues/20
brew 'tree' # List directories in a tree structure
brew 'openssl'
brew 'the_silver_searcher'
brew 'ripgrep'
brew 'emacs-plus'
brew 'kakoune'

# Apps
cask 'visual-studio-code'
cask 'google-cloud-sdk'
cask 'firefox'
cask 'firefox-developer-edition'
cask 'google-chrome'
cask 'docker'
cask 'keybase'
cask 'iterm2'
cask 'slack'
cask 'spotify'
cask 'keepassx'
cask 'transmission'
cask 'vlc'
cask 'omnifocus'
cask 'the-archive-browser'
cask 'wireshark'
cask 'sequel-pro'
cask 'zoomus'

# Fonts
cask 'font-source-code-pro'
cask 'font-source-code-pro-for-powerline'
